//=============================================================================
//
// BGM/SE定義 [SoundData.hpp]
// Author : ISAKI SUGIURA
//
//=============================================================================
#pragma once
LPCWSTR g_pszFileBGM[MAX_BGM] = 
{
	L"MusMus-BGM-151.mp3",	// ゲーム
	L"MusMus-BGM-146.mp3",	// タイトル,ホーム,選択画面
};

LPCWSTR g_pszFileSE[MAX_SE] = 
{
	L"決定ボタンを押す1.mp3",			// ボタン
	L"魔王魂 効果音 システム40.mp3",	// 矢印
	L"魔王魂 効果音 システム44.mp3",	// 攻撃Hit

	L"剣で斬る4.mp3",				// ソーダ―（攻撃１-2連撃）
	L"剣を抜く.mp3",					// ソーダ―（攻撃２-突き構え）
	L"剣の素振り2.mp3",				// ソーダ―（攻撃２-突き突撃）
	L"居合抜き1.mp3",				// ソーダ―（攻撃２-回し斬り）
	L"スローモーション.mp3",			// ソーダ―（攻撃３-構え）
	L"全力で踏み込む.mp3",			// ソーダ―（攻撃３-終わり）
};
