//=============================================================================
//
// BGM/SE定義 [SoundData.h]
// Author : ISAKI SUGIURA
//
//=============================================================================
#pragma once

//＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝
// 列挙型
//＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝
enum eBGM 
{
	BGM_1 = 0,	// ゲーム
	BGM_2,		// タイトル,ホーム,選択画面

	MAX_BGM
};

enum eSE 
{
	SE_1 = 0,	// 決定
	SE_2,		// 矢印
	SE_3,		// 攻撃Hit

	SM_A0101,	// ソーダ―（攻撃１-2連撃）
	SM_A0201,	// ソーダ―（攻撃２-突き構え）
	SM_A0202,	// ソーダ―（攻撃２-突き突撃）
	SM_A0203,	// ソーダ―（攻撃２-回し斬り）
	SM_A0301,	// ソーダ―（攻撃３-構え）
	SM_A0302,	// ソーダ―（攻撃３-終わり）

	MAX_SE
};
